
public class OperatorExample {

	public static void main(String[] args) {


		/*
		 * Operator(연산자) - 항상 결과값을 산출한다. 
		 * Operand(항) - 리터럴과 변수가 온다. 
		 * Expression(연산식)
		 * 
		 * 비트 연산자는 연산이 비트단위로.. 나머지는 타입에 따라 .. 
		 * 
		 * 1항 !(not) + - . [] () ~(비트 not(0,1로 표현))
           ++ --(증감연산자는 리터럴은 올 수 없고 변수만 올 수 있고 항의 값을 변화시킨다.)
		 * 
		 * 2항
		 *   -산술 연산자 : + - * / %(나머지연산) 
		 *   -비트 쉬프트 : << >> >>>
		 *   -관계 연산자 : == != < > <= >=
		 *   -비트 논리 : &  | ^
		 *   -논리 연산자 : &&(and) ||(or) ^(xor)
		 *   
		 * 3항 조건식 ? exp:exp
		 * 
		 * ++ --
		 * 
		 *  대입 연산자 : =  복합대입 연산자 : += -= *= /=(산술연산자와 대입하여) <<= >>= >>>=
		 *   
		 */
		
	
		int b = +10;
		int a = +b;
		
		byte c= +20;
		
		
		
	}

}
